#+TITLE: Emacs config
* org-mode
#+NAME: org-extensions
#+BEGIN_SRC emacs-lisp
  (use-package org-super-agenda
	:config (setq org-super-agenda-mode 1))

  (use-package org-bullets
	:hook (org-mode . (lambda () (org-bullets-mode 1))))
#+END_SRC

https://org-babel.readthedocs.io/en/latest/header-args/
#+NAME: settings
#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-babel-default-header-args
			 '(:results . "silent"))

  (setq org-archive-location "/notes/archive.org")
  (setq org-directory "/notes/")
  (setq org-confirm-babel-evaluate nil)
  (setq org-support-shift-select t)
  (setq org-src-fontify-natively t)
  (setq org-descriptive-links t)
  (setq org-ellipsis "…")
  (org-clock-persistence-insinuate)
  (setq org-clock-out-when-done t)
  (setq org-clock-out-remove-zero-time-clocks t)
  (setq org-drawers (quote ("PROPERTIES" "LOGBOOK")))
  (setq org-clock-into-drawer t)
  (setq org-clock-persist t)
  (setq org-clock-in-resume t)
  (setq org-clock-auto-clock-resolution (quote when-no-clock-is-running))
  (setq org-clock-persist-query-resume nil)
  (setq org-todo-keywords
		(quote ((sequence "TODO(t)" "ACTIVE(a)" "|" "DONE(d)"))))

  (setq org-agenda-files (quote ("/notes/projects.org"
								 "/notes/todos.org"
								 )))

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((R . t)
	 (js . t)
	 (emacs-lisp . t)
	 (shell . t)))
  (setq calendar-week-start-day 1)
#+END_SRC

#+RESULTS: settings
: 1

* Themes
#+BEGIN_SRC emacs-lisp
  (use-package ujelly-theme
	:config
	(load-theme 'ujelly t))
  ;(set-face-attribute 'default t :font Hack )
  ;(set-default-font "hack")
  (set-face-attribute 'default nil
                    :family "Fira Code"
                    :height 100
                    :weight 'normal
                    :width 'normal)
#+END_SRC

#+RESULTS:
#+NAME: undo-fu
#+BEGIN_SRC emacs-lisp
  (use-package undo-fu
	:config
	(global-unset-key (kbd "C-z"))
	(global-set-key (kbd "C-z")   'undo-fu-only-undo)
	(global-set-key (kbd "C-S-z") 'undo-fu-only-redo))
  (use-package undo-fu-session
	:config
	(setq undo-fu-session-incompatible-files '("/COMMIT_EDITMSG\\'" "/git-rebase-todo\\'")
		  undo-fu-session-compression 'zst
		  undo-fu-session-file-limit 2000))

  (global-undo-fu-session-mode)
#+END_SRC

#+RESULTS: undo-fu
: t
